Ac6Embedded/svd-microchip/PIC32CM_GV/PIC32CM3204GV00048.svd
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x18</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>OVR0</name>
                     <description>Channel 0 Overrun</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR1</name>
                     <description>Channel 1 Overrun</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR2</name>
                     <description>Channel 2 Overrun</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR3</name>
                     <description>Channel 3 Overrun</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR4</name>
                     <description>Channel 4 Overrun</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR5</name>
                     <description>Channel 5 Overrun</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR6</name>
                     <description>Channel 6 Overrun</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR7</name>
                     <description>Channel 7 Overrun</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD0</name>
                     <description>Channel 0 Event Detection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD1</name>
                     <description>Channel 1 Event Detection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD2</name>
                     <description>Channel 2 Event Detection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD3</name>
                     <description>Channel 3 Event Detection</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD4</name>
                     <description>Channel 4 Event Detection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD5</name>
                     <description>Channel 5 Event Detection</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD6</name>
                     <description>Channel 6 Event Detection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD7</name>
                     <description>Channel 7 Event Detection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>GCLK</name>
         <version>U21022.1.0</version>
         <description>Generic Clock Generator</description>
         <baseAddress>0x40000C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SYNCBUSY</name>
                     <description>Synchronization Busy Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKCTRL</name>
               <description>Generic Clock Control</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Generic Clock Selection ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>IDSelect</name>
                        <enumeratedValue>
                           <name>DFLL48M</name>
                           <description>DFLL48M Reference</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDT</name>
                           <description>WDT</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RTC</name>
                           <description>RTC</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EIC</name>
                           <description>EIC</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_CHANNEL_0</name>
                           <description>EVSYS_CHANNEL_0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_CHANNEL_1</name>
                           <description>EVSYS_CHANNEL_1</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_CHANNEL_2</name>
                           <description>EVSYS_CHANNEL_2</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_CHANNEL_3</name>
                           <description>EVSYS_CHANNEL_3</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_CHANNEL_4</name>
                           <description>EVSYS_CHANNEL_4</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_CHANNEL_5</name>
                           <description>EVSYS_CHANNEL_5</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_CHANNEL_6</name>
                           <description>EVSYS_CHANNEL_6</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_CHANNEL_7</name>
                           <description>EVSYS_CHANNEL_7</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOMX_SLOW</name>
                           <description>SERCOMx_SLOW</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM0_CORE</name>
                           <description>SERCOM0_CORE</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM1_CORE</name>
                           <description>SERCOM1_CORE</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM2_CORE</name>
                           <description>SERCOM2_CORE</description>
                           <value>0xF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM3_CORE</name>
                           <description>SERCOM3_CORE</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM4_CORE</name>
                           <description>SERCOM4_CORE</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM5_CORE</name>
                           <description>SERCOM5_CORE</description>
                           <value>0x12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC0_TC1</name>
                           <description>TC0,TC1</description>
                           <value>0x13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC2_TC3</name>
                           <description>TC2,TC3</description>
                           <value>0x14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC4_TC5</name>
                           <description>TC4,TC5</description>
                           <value>0x15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC6_TC7</name>
                           <description>TC6,TC7</description>
                           <value>0x16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC</name>
                           <description>ADC</description>
                           <value>0x17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC_DIG</name>
                           <description>AC_DIG</description>
                           <value>0x18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC_ANA</name>
                           <description>AC_ANA</description>
                           <value>0x19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAC</name>
                           <description>DAC</description>
                           <value>0x1A</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GEN</name>
                     <description>Generic Clock Generator</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>GENSelect</name>
                        <enumeratedValue>
                           <name>GCLK0</name>
                           <description>Generic clock generator 0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK1</name>
                           <description>Generic clock generator 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK2</name>
                           <description>Generic clock generator 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK3</name>
                           <description>Generic clock generator 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK4</name>
                           <description>Generic clock generator 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK5</name>
                           <description>Generic clock generator 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK6</name>
                           <description>Generic clock generator 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK7</name>
                           <description>Generic clock generator 7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKEN</name>
                     <description>Clock Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRTLOCK</name>
                     <description>Write Lock</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
